Feature: Управление на потребителски профили

  Scenario: Добавяне на нов потребителски профил
    Given, че репозиториумът за потребителски профили е инициализиран
    When добавя нов потребителски профил с id 4, първо име "Емили", фамилно име "Браун", възраст 25, пол "FEMALE", височина 170, тегло 55 и мазнини 22
    Then репозиториумът за потребителски профили трябва да съдържа 4 потребителски профила

  Scenario: Актуализиране на съществуващ потребителски профил
    Given, че репозиториумът за потребителски профили е инициализиран
    When актуализирам потребителския профил с id 1 с първо име "Джонатан", фамилно име "Доу", и възраст 31
    Then потребителският профил с id 1 трябва да има първо име "Джонатан", фамилно име "Доу" и възраст 31

  Scenario: Изтриване на съществуващ потребителски профил
    Given, че репозиториумът за потребителски профили е инициализиран
    When изтривам потребителския профил с id 2
    Then репозиториумът за потребителски профили трябва да съдържа 2 потребителски профила

  Scenario: Намиране на съществуващ потребителски профил
    Given, че репозиториумът за потребителски профили е инициализиран
    When намирам потребителския профил с id 3
    Then трябва да получа потребителския профил с първо име "John", фамилно име "Doe", възраст 30, пол "MALE", височина 180, тегло 75.0 и мазнини 15

  Scenario: Намиране на несъществуващ потребителски профил
    Given, че репозиториумът за потребителски профили е инициализиран
    When намирам потребителския профил с id 10
    Then трябва да не получа никакъв потребителски профил
