Feature: Управление на храни в хранилището

  Scenario: Добавяне на нов хранителен продукт в хранилището
    Given хранилището е инициализирано
    When добавям хранителен продукт с id 4, име "salad", 20.0 калории, 5.0 протеин, 3.0 въглехидрати и 2.0 мазнини
    Then хранилището трябва да съдържа 4 хранителни продукта

  Scenario: Намиране на хранителен продукт по id
    Given хранилището е инициализирано
    When търся хранителния продукт с id 1
    Then трябва да получа хранителен продукт с име "pizza"

  Scenario: Изтриване на хранителен продукт от хранилището
    Given хранилището е инициализирано
    When изтривам хранителния продукт с id 2
    Then хранилището трябва да съдържа 2 хранителни продукта

  Scenario: Получаване на всички хранителни продукти
    Given хранилището е инициализирано
    When получавам всички хранителни продукти
    Then трябва да получа 3 хранителни продукта

  Scenario: Добавяне на дублиращ хранителен продукт
    Given хранилището е инициализирано
    When добавям хранителен продукт с id 1, име "pizza", 10.0 калории, 50.0 протеин, 12.5 въглехидрати и 7.5 мазнини
    Then хранилището трябва да съдържа все още 3 хранителни продукта